#include <stdio.h>

const int GLOBAL_RATE = 20; 

void calculate(){
    const int LOCAL_BONUS = 80; 
    printf("GLOBAL_RATE = %d\n", GLOBAL_RATE);
    printf("LOCAL_BONUS + %d\n", LOCAL_BONUS);
}

int main(){
    calculate();
    printf("GLOBAL_RATE = %d\n", GLOBAL_RATE);
    return 0;
}

//ค่าคงที่ Global Rate และ Local Bonus ต่างกันอย่างไร
  //ค่าคงที่ Global Rate เป็นค่าคงที่ที่ประกาศในระดับ global ซึ่งสามารถเข้าถึงได้จากทุกฟังก์ชันในโปรแกรม
  //ในขณะที่ Local Bonus เป็นค่าคงที่ที่ประกาศภายในฟังก์ชัน calculate() ซึ่งสามารถเข้าถึงได้เฉพาะภายในฟังก์ชันนั้นเท่านั้น
//เกิดอะไรขึ้นถ้าเราเขียน Global rate = 20 และ Local bonus = 80
  //เมื่อiyนค่า จะมีการเปลี่ยนแปลงค่า Global Rate in main จาก 10 เป็น 20
//ทําไม Local Bonus ถึงไม่สามารถเข้าถึงได้ใน main
  //เพราะ Local Bonus ถูกประกาศภายในฟังก์ชัน calculate() ทำให้มันมีขอบเขตการใช้งานเฉพาะภายในฟังก์ชันนั้นเท่านั้น
//อภิปราย และสรุปผลจากการทดลอง
  //การใช้ค่าคงที่ Global Rate และ Local Bonus แสดงให้เห็นถึงความแตกต่างระหว่างค่าคงที่ที่ประกาศในระดับ global และ local
  //การประกาศค่าคงที่ในระดับ global ทําให้สามารถเข้าถึงได้จากทุกฟังก์ชันในโปรแกรม ในขณะที่ค่าดงที่ที่ประกาศในระดับ local จะมีขอบเขตการใช้งานเฉพาะภายในฟังก์ชันนั้น
  //การเลือกใช้ค่าคงที่ที่เหมาะสมจะช่วยให้โปรแกรมทำงานได้อย่างมีประสิทธิภาพ และสามารถจัดการกับข้อมูลได้อย่างถูกต้อง