//ผลลัพธ์ที่ได้ต่างกันอย่างไร
  //แตกต่างกันที่ค่าของ counter ที่ถูกเก็บไว้ระหว่างการเรียกใช้งานฟังก์ชัน เพราะในกรณีที่ใช้ static int counter จะทำให้ค่าของ counter ถูกเก็บไว้ แต่ในกรณีที่ใช้ int counter จะทำให้ค่าของ counter ถูกรีเซ็ตเป็น 0

//ความแตกต่างของ Non-static Variable
  //การใช้ static จะทำให้ตัวแปรนั้นมีอายุการใช้งานตลอดทั้งโปรแกรม และค่าของมันจะถูกเก็บไว้ระหว่างการเรียกใช้งานฟังก์ชัน ในขณะที่ Non-static จะทำให้ตัวแปรนั้นมีอายุการใช้งานเฉพาะในบล็อกที่มันถูกประกาศ
  //และค่าของมันจะถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียกใช้งาน

//อภิปราย และสรุปผลที่ได้จากการทดลอง
  //การใช้ static int counter จะทำให้ค่าของ counter ถูกเก็บไว้ระหว่างการเรียกใช้งานฟังก์ชัน ทำให้สามารถนับจำนวนครั้งที่ฟังก์ชันถูกเรียกได้อย่างถูกต้อง
  //ในขณะที่การใช้ int counter จะทำให้ค่าของ counter ถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียก ทำให้ไม่สามารถนับจำนวนครั้งที่ฟังก์ชันถูกเรียกได้อย่างถูกต้อง
